<?php

namespace app\common\command;

use think\console\Command;
use think\console\Input;
use think\console\input\Argument;
use think\console\input\Option;
use think\console\Output;

class Train extends Command
{
    protected function configure()
    {
        $this->setName('train')
            ->addArgument('station', Argument::OPTIONAL, "出发车站")
            ->addOption('date', null, Option::VALUE_REQUIRED, '预定日期')
            ->setDescription('查询火车票最早的预售日期');
    }

    protected function execute(Input $input, Output $output)
    {

        $station = trim($input->getArgument('station'));
        $date = trim($input->getOption('date'));

        $bookingDate = date("Y-m-d", strtotime("-14 days", strtotime($date)));
        $bookingTime = $this->getTime($station);

        $inputString = sprintf("出发日期：%s，出发车站：%s",$date,$station);
        $resString = sprintf("最早可以预定的日期时间：%s %s",$bookingDate,$bookingTime);
        $output->writeln($inputString);
        $output->highlight($resString);
    }


    protected function getTime($startStation)
    {
        $data = [
            "8:00"=>"北京西、南京、南京南、宋城路、绿博园、新郑机场、南阳寨、黄河景区、武陟、修武西、北京丰台",
            "8:30"=>"白城、成都东、东莞、东莞东、惠州、济宁、南充、日照、山海关、汕头、松原、乌兰浩特、乌鲁木齐南、乌鲁木齐、岚山西、日照西、锦州、锦州南、锦州北、济宁东、济宁北",
            "9:00"=>"阿克苏、阿克陶、阿拉山口、阿图什、巴楚、北屯市、博乐东、布列开、成都、大庆、大庆西、福海、哈密、和静、和什托洛盖、和田、霍尔果斯、精河、精河南、喀什、克拉玛依、库车、库尔勒、奎屯、兰州、兰州西、柳园、柳园南、轮台、玛纳斯、玛纳斯湖、墨玉、尼勒克、皮山、萍乡、萍乡北、齐齐哈尔、沙湾市、莎车、鄯善、鄯善北、深圳北、深圳、深圳东、深圳西、沈阳北、石河子、疏勒、吐哈、吐鲁番、吐鲁番北、乌西、五五、新和、焉耆、叶城、伊宁、伊宁东、宜春、英吉沙、泽普、成都南、柳园南、和硕、马兰、大庆东、齐齐哈尔南、福利区、西固、兰州新区、中川机场、宾西北、宾州、胜利镇、双龙湖、方正、得莫利、高楞、达连河、依兰、宏克力、佳木斯西、达坂城、新香坊北、阿城北、帽儿山西、尚志南、一面坡北、苇河西、亚布力西、横道河子东、海林北、乌苏、昆玉、四棵树、塔城、额敏、铁厂沟、博乐、双河市、图木舒克、林口南、鸡西西、七台河西、桦南东、双鸭山西、阿拉尔、阿瓦提、瓦石峡、且末、金山、南屯、民丰、于田、玉泉镇、策勒、洛浦",
            "9:30"=>"平阳、苍南、德清、德清西、奉化、海宁、海宁西、湖州、加格达奇、嘉善南、嘉兴、嘉兴南、金山北、乐清、临海、漠河、南昌、南昌西、讷河、宁海、青岛、青岛北、瑞安、三门县、上虞、上虞北、上虞南、绍兴、绍兴北、乐清东、沈阳、沈阳南、松江南、台州、桐乡、温岭、温州南、雁荡山、永嘉、临平南、余姚、余姚北、长兴、长兴南、庄桥、安吉、宁波、温州、缙云、永康、武义、壶镇、磐安南、仙居南、临海南、杜桥、头门港、青岛机场、青岛西、嵊州北、嵊州新昌、天台山",
            "10:00"=>"北京、广州南、贵阳、哈尔滨西、贵阳北、哈尔滨北、芜湖、东至、宣城、广德、黄山、池州、绩溪县、铜陵北、南陵、泾县、宁国、歙县北、绩溪北、旌德、黄山北、马鞍山东、歙县、当涂东、繁昌西、祁门、戈江、铜陵、阿勒泰 、霍城、三阳、含山南、广德南、郎溪南、湾沚南、芜湖北、哈尔滨、哈尔滨东、香坊、贵阳东、北京朝阳",
            "10:30"=>"敦煌、杭州、嘉峪关、威海、西安北、烟台、银川、嘉峪关南、荣成、文登、文登东、威海北、牟平、烟台南、桃村、桃村北、海阳北、徐家店、莱阳、莱西、莱西北、莱西南、即墨北、烟台西、富阳、桐庐、建德、千岛湖、夏格庄、杭州东、杭州南",
            "11:00"=>"滨江、广州、九江、重庆、重庆北、重庆西、沙坪坝",
            "11:30"=>"白银市、白银西、大武口、低窝铺、定边、定西、甘谷、皋兰、高台、古浪、固原、瓜州、广州东、河口南、红寺堡、惠农、金昌、景泰、靖远、镜铁山、酒泉、临泽、灵武、陇西、绿化、平凉、青铜峡、清水、山丹、石嘴山、疏勒河、太阳山、谭家井、天水、天祝、同心、渭南镇、武山、武威、武威南、西安、夏官营、新阳镇、盐池、永登、玉门、张掖、长征、中宁、中宁东、中卫、民乐、张掖西、临泽南、高台南、清水北、酒泉南、玉门、长庆桥、泾川、宁东、宁东南、渭源、漳县、岷县、哈达铺、陇南、姚渡、榆中、定西北、通渭、秦安、天水南、东岔、张家川、清水县、河东机场、灵武北、吴忠、红寺堡北、中卫南、肃北、阿克塞、宁县、庆阳、庆城、曲子、环县、惠安堡、广州北、甜水堡、石牌、山丹马场",
            "12:00"=>"安阳、安阳东、宝鸡、宝鸡南、北京北、汉口、江山、金华、兰溪、临汾、临汾西、龙游、衢州、新乡、新乡东、义乌、运城、运城北、长春、长春西、诸暨、武义北、永康南、缙云西、濮阳、开化、常山、龙泉市、龙游南、遂昌、松阳、庆元、青田、丽水、内黄、滑浚、卫辉南、新乡南、濮阳东",
            "12:30"=>"安庆、安庆西、北京南、巢湖、肥东、广元、汉中、合肥、合肥北城、合肥南、黄梅、金寨、六安、庐江、绵阳、全椒、舒城、太湖、天柱山、桐城、武昌、宿松、昭化、合肥西、长临河、巢湖东、无为、无为南、龙桥、柘皋、肥东、肥西、庐江西、舒城东、桐城东、桐城南、安庆西、潜山、太湖南、宿松东、黄梅东、宝华山、镇江、镇江南、丹徒、丹阳、丹阳北、大港南、句容西",
            "13:00"=>"亳州、赤峰、达州、大连、大连北、阜南、阜阳、淮南、淮南东、霍邱、内江、三堂集、水家湖、天津南、通辽、昭通、贾鲁河、运粮河、内江北、南曹、孟庄、颍上、周口东、淮阳南、长葛北、禹州、郏县、许昌北、鄢陵、扶沟南、西华、沈丘北、阜阳西、亳州南、太和东、临泉、界首南、芦庙、古城东、颍上北、凤台南、寿县、淮南南、赤峰南、自贡、泸州",
            "13:30"=>"博鳌、大同、东方、海口、海口东、吉林、陵水、六盘水、美兰、琼海、三亚、上海虹桥、神州、万宁、文昌、武汉、亚龙湾、遵义西、金月湾、遵义、长流、秀英、城西、大同南、六盘水东、许昌、许昌东、长葛、武汉东",
            "14:00"=>"北滘、碧江、常平、潮汕、潮阳、福田、潮州、春湾、大埔、丹霞山、东升、丰顺、佛山、高州、古镇、光明城、和平、河源、鲘门、呼和浩特、呼和浩特东、虎门、华城、惠东、惠州南、惠州西、济南、大明湖、济南西、江门、揭阳、葵潭、乐昌、雷州、龙川、陆丰、茂名东、梅州、梅州西、畲江北、建桥、丰顺东、揭阳、揭阳机场、明珠、南朗、南头、南雄、平湖、坪石、普宁、前山、清远、庆盛、饶平、容桂、三水、汕尾、韶关、韶关东、深圳坪山、石家庄、石家庄北、始兴、顺德、顺德学院、太原南、唐家湾、小榄、新会、新兴县、信宜、兴宁、徐闻、阳春、英德、英德西、源潭、湛江、湛江西、樟木头、肇庆、郑州、郑州西、中山、中山北、珠海、珠海北、郁南、南江口、云浮东、怀集、广宁、三水南、肇庆东、佛山西、道滘、西平西、东城南、寮步、松山湖北、大朗镇、常平南、吴川、双水镇、台山、开平南、恩平、阳东、阳江、阳西、马踏、电白、济南东、新塘南、厚街、东莞港、洪梅、深圳机场、东莞西、望牛墩、深圳机场北、中堂、福海西、沙井西、长安、长安西、虎门东、虎门北、湾仔、湾仔北、十字门、横琴北、横琴、珠海长隆、江门、花都、乐同、狮岭、银盏、龙塘镇、清城、花城街、花山镇、白云机场北、郑州东、陈江南、郑州航空港",
            "14:30"=>"包头、包头东、长沙、长沙南、德州、德州东、邯郸、邯郸东、昆明、昆明南、攀枝花、上海、太原、西昌、西昌西、宜昌、宜昌东、乐昌东、攀枝花南、上海南",
            "15:00"=>"安塘、巴彦高勒、白壁关、白音察干、白云鄂博、柏果、查布嘎、察素齐、岔江、柴沟堡、楚雄南、达拉特旗、达拉特西、大板、大理、大营、代县、岱岳、德令哈、甸心、定襄、东胜、东胜西、东淤地、东镇、东庄、豆罗、兑镇、额济纳、二连、发耳、繁峙、汾阳、丰镇、风陵渡、富源、高村、格尔木、公庙子、古东、古交、广安、广水、广通北、海石湾、河边、河津、鹤庆、黑井、红果、洪洞、洪洞西、侯马、侯马西、化德、怀仁、怀仁东、湟源、霍州、霍州东、集宁南、稷山、建水、江所田、交城、介休、介休东、晋中、经棚、开鲁、岢岚、昆阳、拉萨、老羊壕、乐都、丽江、林东、林西、临河、灵丘、灵石、灵石东、柳林南、鲁番、陆良、禄丰南、罗平、吕梁、麻城、麻城北、茅草坪、蒙自北、明安、那曲、南宁、尼木、宁武、盘关、平安驿、平关、平社、平田、平旺、平型关、平遥、平遥古城、祁县、祁县东、旗下营、秦家庄、沁县、清徐、曲靖、曲水县、仁布、日喀则、萨拉齐、赛汗塔拉、三家寨、桑根达来、厦门、厦门北、厦门高崎、山阴、商都、商丘、商丘南、神池、神头、师宗、十堰、石林、寿阳、朔州、松河、遂宁、太谷、太谷西、太原北、太原东、天镇、通海、土贵乌拉、土牧尔台、万州、威箐、威舍、文水、闻喜、闻喜西、乌海、乌海西、乌拉特前旗、五台山、五原、五寨、武乡、西斗铺、西小召、锡林浩特、下社、襄汾、襄汾西、祥云、小雨谷、孝南、孝西、忻州、新绛、信阳、信阳东、兴和西、轩岗、宣威、延安、阳高、阳明堡、阳曲、阳泉曲、宜良北、营盘湾、应县、永济、永济北、榆次、榆社、雨格、玉溪、元谋、原平、月亮田、枣林、张兰、赵城、哲里木、镇城底、正镶白旗、朱日和、卓资东、卓资山、蒙自、屏边、河口北、杨林、小新街、南宁东、西宁、民和南、乐都南、海东西、大通西、门源、鄂尔多斯、杭锦后旗、汾河、西乌旗、白音华南、茶卡、苏尼特左旗、阿巴嘎旗、昆独仑召、万州北、广安南、嵩明、曲靖北、富源北、富宁、广南县、普者黑、弥勒、石林西、树木岭、香樟路、湘府路、洞井、先锋、芙蓉南、暮云、九郎山、田心东、大丰、株洲南、昭山、荷塘、板塘、乌兰察布、旗下营南、准格尔、东胜东、娄烦、岚县、白文东、蔡家崖、楚雄、南华、云南驿、祥云、珠琳、海宴、托克托东、十堰东、元谋西、永仁、阳高南、兴和北、乌审旗、花土沟、太谷东、榆社西、武乡、临沧、云县、巍山、开封、开封北、兰考、兰考南、民权北、民权、宁陵县、个旧、天津北、天津西、天津、林芝、贡嘎、扎囊、山南、桑日、加查、朗县、米林、岗嘎、小湾东、峨山、化念、元江、墨江、宁洱、普洱、野象谷、西双版纳、橄榄坝、勐腊、磨憨、漾濞、保山、永平县",
            "15:30"=>"安德、安顺、鞍山、鞍山西、巴中、白沙、白山市、草海、承德、大关、大英东、丹东、德昌、德阳、都江堰、都匀、独山、峨边、峨眉、丰都、涪陵、涪陵北、福泉、抚顺北、阜新、甘洛、赣州、高兴、广汉、贵定、汉源、合川、红光镇、华蓥、潢川、吉安、佳木斯、简阳、江油、井冈山、开江、凯里、乐山北、离堆公园、梁平、六枝、龙里、隆昌、罗江、麻尾、眉山、米易、冕宁、牡丹江、盘锦、盘锦北、彭山、彭水、彭州、蓬安、郫县、郫县西、平顶山西、平顶山、宝丰、普雄、黔江、秦皇岛、青城山、渠县、三汇镇、施秉、石柱县、水富、唐山、通化、桐子林、潼南、图们、土溪、旺苍、武隆、西昌南、息烽、犀浦、犀浦东、喜德、秀山、延吉、盐津、燕岗、宜宾、迎宾路、营山、永郎、酉阳、玉屏、岳池、岳阳、岳阳东、越西、张家口、长寿、长寿北、镇远、织金、重庆南、周口、朱杨溪、株洲、株洲西、竹园坝、驻马店、驻马店西、资阳、资中、青莲、罗江东、广汉北、青白江东、新都东、双流机场、新津、彭山北、眉山东、青神、乐山、峨眉山、龙里北、贵定县、三都县、榕江、从江、都匀东、铜仁南、三穗、凯里南、贵定北、普定、简阳南、资阳北、资中北、隆昌北、荣昌北、永川东、大足南、苍溪、阆中、南部、武胜、巴中东、曾口、平昌、石桥、石梯、织金北、长寿湖、垫江、梁平南、平坝南、安顺西、关岭、普安县、盘州、大方南、法启、八步、新津南、双流西、璧山、安靖、安多、朝天、剑门关、青川、江油北、珞璜南、綦江东、赶水东、桐梓北、桐梓东、娄山关南、遵义南、修文县、蓬溪、朱砂古镇、赣榆、响水县、滨海港、阜宁东、射阳、南充北、步行街、彭州南、犍为、泥溪、屏山、宜宾西、长宁、兴文、威信、镇雄、毕节、大方、黔西、清镇西、白云北、吉安西、赣县北、赣州西、长箐、冷坝、六枝南、黄桶北、开阳、广元南、贵安、龙洞堡、纳雍、南江、百宜、洛湾三江、高兴、延吉西、图们北、内江东、白马北、富顺、泸县、德昌西、双龙南 、孟关、金阳、金阳南、花溪南、花溪西、花溪大学城、党武、天河潭、湖潮东、芦官、金华镇、白云西、奉节、云阳、巫山",
            "16:00"=>"安康、安亭北、八达岭、霸州、白涧、宝坻北、保定、保定东、北戴河、北京东、北马圈子、滨海西、滨海北、泊头、沧州、沧州西、昌黎、昌平、昌平北、承德东、磁山、磁县、大营镇、定州、定州东、东光、福州、福州南、抚宁、高碑店、高碑店东、高邑、高邑西、藁城、固安、关林、官厅、官厅西、郭磊庄、海拉尔、汉沽、菏泽、衡水、衡阳、衡阳东、虎什哈、花桥、怀柔、怀柔北、黄村、惠山、蓟州北、晋州、井店、井陉、井南、静海、军粮城北、康城、康庄、昆山、昆山南、涞源、廊坊、廊坊北、黎城、临沂、临沂东、柳州、龙华、隆化、卢龙、芦台、潞城、滦河、滦平、滦县、洛阳、洛阳东、洛阳龙门、满洲里、密云北、南宫东、南口、南翔北、南峪、娘子关、潘家店、平泉、迁安、前磨头、青县、清河、清河城、清华园、饶阳、任丘、三河县、三家店、沙城、沙河、沙河市、沙岭子、张家口南、上板城、上板城南、上海西、涉县、深州、十渡、石景山南、顺义、苏州、苏州北、苏州新区、苏州园区、肃宁、绥芬河、唐山北、塘沽、通州西、王瞳、望都、文安、无锡、无锡东、无锡新区、吴桥、武安、武清、下板城、下花园、下台子、襄阳、襄阳东、襄州、小寺沟、辛集、新乐、新杖子、邢台、邢台东、兴隆县、徐水、宣化、延庆、岩会、燕郊、燕山、阳澄湖、阳泉、阳泉北、阳邑、杨村、杨柳青、野三坡、鹰手营子、榆林、玉田县、元氏、枣强、正定机场、涿州、涿州东、百里峡、正定、滨海、胜芳、霸州西、白沟、白洋淀、伊敏、阿尔山北、临城、黄土店、通州、石家庄东、藁城南、辛集南、衡水北、景州、西渡、南堡北、唐海南、曹妃甸港、曹妃甸东、承德南、承德县北、平泉北、蓟州、黑山寺、古北口、雁栖湖、乔庄东、魏家泉、准东、北京大兴、大兴机场、平邑、蒙山、费县、费县北、临沂北、莒南、莒南北、厉家寨、八达岭长城、东花园北、怀来、下花园北、宣化北、太子城、怀安、安亭西、张家港、常熟、太仓、太仓南、良乡、牛栏山、固安东、霸州北、雄安、顺义西、密云、怀柔南、安匠、兴隆县西、新安县、偃师、菏泽东、崇礼",
            "16:30"=>"阿城、阿尔山、阿金、阿里河、阿龙山、阿木尔、安达、安广、安家、安平、安图、昂昂溪、敖力布告、八角台、八面城、八面通、八仙筒、巴林、鲅鱼圈、白河、白奎堡、白狼、白泉、白石山、白音胡硕、白音他拉、宝林、宝龙山、宝清、宝泉岭、保康、北安、北票南、北台、背荫河、本溪、本溪湖、笔架山、勃利、博克图、布海、蔡家沟、苍石、草河口、草市、柴岗、柴河、昌图、昌图西、常德、朝阳南、朝阳川、朝阳地、朝阳镇、辰清、陈相屯、晨明、成高子、成吉思汗、赤峰西、楚山、春阳、嵯岗、达家沟、大安、大安北、大巴、大堡、大成、大官屯、大红旗、大虎山、大林、大平房、大青沟、大石桥、大石头、大石寨、大屯、大兴、大兴沟、大雁、大杨树、大营子、带岭、刀尔登、到保、道清、得耳布尔、德伯斯、德惠、德惠西、灯塔、登沙河、滴道、东边井、东戴河、东二道河、东方红、东丰、东海、东津、东京城、东来、东明村、东通化、东辛庄、杜家、对青山、敦化、恩施、二道湾、二龙、二龙山屯、二密河、范家屯、丰乐镇、冯屯、凤凰城、扶余、扶余北、福利屯、抚顺、抚远、富海、富锦、富拉尔基、富裕、嘎什甸子、盖州、盖州西、甘河、甘旗卡、干沟、高桥镇、高山子、大连西、葛根庙、根河、工农湖、公营子、公主岭、公主岭南、沟帮子、孤家子、菇园、古城镇、古莲、官字井、灌水、广宁寺、归流河、郭家店、果松、哈拉海、哈拉苏、海北、海城、海城西、海林、海龙、海伦、海坨子、寒葱沟、寒岭、浩良河、和龙、鹤北、鹤岗、鹤立、黑河、黑水、黑台、横道河子、红花沟、红山、红星、红兴隆、红彦、洪河、呼兰、呼源、呼中、葫芦岛、葫芦岛北、虎林、虎石台、华家、桦林、桦南、换新天、皇姑屯、黄柏、黄花筒、黄泥河、黄松甸、浑河、火连寨、霍林郭勒、鸡东、鸡冠山、鸡西、吉舒、吉文、集安、纪家沟、夹心子、建昌、建三江、建设、江桥、江源、姜家、蛟河、金宝屯、金河、金坑、金山屯、金杖子、金州、锦河、九三、九台、九台南、巨宝、峻德、开安、开通、开原、开原西、康金井、克东、克山、克一河、口前、库都尔、库伦、宽甸、奎山、拉古、拉哈、拉林、兰岗、兰棱、朗乡、老边、老府、老莱、老营、梨树镇、李家、李石寨、里木店、利川、连山关、莲江口、两家、亮甲店、辽阳、辽源、辽中、林海、林口、林源、临江、凌海、凌源、凌源东、刘家店、刘家河、柳河、柳树屯、六合镇、龙嘉、龙江、龙井、龙爪沟、龙镇、鹿道、露水河、漯河、漯河西、旅顺、麻山、马莲河、马林、马桥河、马三家、满归、茂林、帽儿山、梅河口、美溪、孟家岗、米沙子、密山、免渡河、庙岭、明城、明水河、磨刀石、莫尔道嘎、木里图、穆棱、乃林、奈曼、南岔、南芬、南关岭、南口前、南木、南桥、南台、南杂木、嫩江、能家、泥河子、碾子山、宁安、宁家、牛家、牛心台、农安、磐石、泡子、裴德、皮口、偏岭、瓢儿屯、平安、平安镇、平房、平岗、平山、平台、平洋、平庄、平庄南、普兰店、普湾、七里河、七台河、祁家堡、蕲春、前锋、前进镇、前卫、乾安、桥头、秦家、青山、清河门、清原、庆安、庆丰、曲阜、曲阜东、泉阳、绕阳河、热水、三间房、三江口、三十家、三十里堡、三义井、三源浦、沙海、沙河口、沙后所、山城镇、山河屯、山市、上园、尚家、尚志、舍力虎、深井子、神树、沈家、沈阳东、石城、石磷、石岭、石桥子、石人、石人城、石山、石头、石岘、世博园、首山、舒兰、双城堡、双城北、双丰、双河镇、双辽、双鸭山、水洞、水泉、四道湾、四方台、四合永、四平、四平东、松江河、松江镇、松树、松树镇、宋、苏家屯、绥化、绥棱、绥阳、绥中、绥中北、孙家、孙吴、索伦、塔尔气、塔哈、塔河、台安、太平川、太平镇、太阳升、泰安、泰康、泰来、泰山、汤池、汤山城、汤旺河、汤原、洮南、桃山、陶家屯、陶赖昭、天岗、天桥岭、天义、田师府、铁厂、铁力、铁岭、铁岭西、通北、通沟、通化县、通途、通远堡、图里河、图强、吐列毛杜、团结、驼腰岭、瓦房店、瓦房店西、歪头山、湾沟、万发屯、万乐、汪清、王府、王岗、王兆屯、潍坊、苇河、苇子沟、卫东、卫星、渭津、魏杖子、温春、倭肯、沃皮、卧里屯、乌尔旗汗、乌奴耳、乌伊岭、吴家屯、五叉沟、五常、五大连池、五道沟、五家、五棵树、五龙背、五女山、五营、西丰、西岗子、西林、西柳、西麻山、西哲里木、汐子、下城子、下马塘、仙人桥、香兰、襄河、向阳、小河沿、小岭、小市、小扬气、谢家镇、新绰源、新城子、新华、新华屯、新立屯、新立镇、新林、新民、新青、新邱、新松浦、新窝铺、新友谊、新肇、兴城、兴凯、兴隆店、兴隆镇、杏树、杏树屯、熊岳城、徐家、许家屯、鸭园、牙克石、亚布力、亚布力南、烟筒山、烟筒屯、羊草、敖汉、阳岔、杨岗、杨树岭、杨杖子、姚家、姚千户屯、叶柏寿、一间堡、一面坡、一面山、伊春、伊尔施、伊拉哈、伊林、伊图里河、依安、义县、益阳、银浪、迎春、营城子、营口、营口东、永安乡、友好、余粮堡、榆树、榆树台、榆树屯、玉泉、元宝山、咋子、扎赉诺尔西、扎兰屯、扎鲁特、张家界、张维屯、章党、章古台、彰武、长春南、长甸、长岭子、长山屯、长汀镇、赵光、肇东、镇赉、镇西、治安、周家、周家屯、周水子、朱家沟、淄博、松原北、弓棚子、三井子、本溪新城、南芬北、通远堡西、凤城东、五龙背东、蛟河西、威虎岭北、大石头南、安图西、珲春、青龙、靖宇、三道湖、抚松、丹东西、东港北、北井子、大孤山、青堆、庄河北、花园口、城子坦、皮口、广宁寺、双吉、珠斯花、查干湖、双阳、伊通、建安、高花、近海、台安南、盘山、义县西、淄博北、潍坊北、清河城北、岫岩、桃源、牛车河、张家界西、桑植、龙山北、来凤、咸丰、平庄、宁城、建平、辽宁朝阳、同江、凌海南、巴图营、长白山、永庆、曲阜南、蕲春南、益阳南",
            "17:00"=>"栟茶、常州、常州北、东台、阜宁、桂林、桂林北、海安、怀化、淮安、建湖、江都、江宁、姜堰、晋城、晋城北、荆门、荆州、景德镇、溧水、溧阳、龙岩、娄底、南通、南阳、戚墅堰、潜江、如东、如皋、上饶、邵阳、沭阳、泗洪、泗阳、随州、泰州、天门南、瓦屋山、仙林、盐城、扬州、洋河、宜兴、鹰潭、永州、枣阳、长治、长治北、江宁西、桂林西、景德镇北、邵阳西、隆回、洞口、安江东、随州南、随县、商丘东、淮安东、宿迁、阜宁南、盐城北、启东、海门、涟水、南通西、长治东、长治南、晋城东、盐城大丰、南阳东、如皋南、方城、邓州、邓州东、襄垣、襄垣东、高平、高平东",
            "17:30"=>"安化、安龙、安仁、百色、北海、北流、册亨、岑溪、郴州、郴州西、辰溪、崇左、慈利、砀山、道州、德安、低庄、定南、东安东、东海县、东明县、东乡、防城港北、分宜、丰城、丰城南、扶绥、抚州、富川、高安、巩义、巩义南、共青城、贵港、贵溪、桂平、韩城、汉寿南、合浦、河唇、贺州、鹤壁、鹤壁东、横峰、衡南、衡山、衡山西、湖口、化州、黄口、会同、获嘉、吉首、济源、嘉峰、江华、江永、焦作、焦作东、金城江、进贤、靖州、来宾、来宾北、濑湍、乐平市、耒阳、耒阳西、冷水江东、黎塘、澧县、醴陵、醴陵东、连云港、连云港东、涟源、廉江、临澧、临湘、临颍、灵宝、灵宝西、零陵、龙南、龙市、芦溪、庐山、鲁山、陆川、鹿寨、路口铺、罗城、麻阳、茂名、猛洞河、汨罗、汨罗东、渑池、渑池南、南城、南丹、南丰、南召、内乡、宁明、宁乡、彭泽、邳州、平果、平南南、凭祥、祁东、祁阳、钦州、钦州东、沁阳、渠旧、渠黎、全州南、容县、融安、融水、汝阳、汝州、瑞昌、瑞金、三江县、三门峡、三门峡南、三门峡西、韶山、神木、石门县北、双牌、松桃、遂溪、泰和、汤阴、唐河、藤县、田东、田林、田阳、亭亮、通道、桐柏、铜仁、万年、卫辉、文地、梧州、梧州南、西峡、峡江、夏石、夏邑县、湘潭、湘乡、向塘、新干、新化、新晃、新沂、新余、新余北、信丰、兴安北、兴国、兴业、兴义、修武、徐州、徐州东、溆浦、牙屯堡、炎陵、阳城、宜春西、宜州、弋阳、义马、永福南、永修、攸县、攸县南、于都、于都北、余江、虞城县、玉林、玉山、月山、樟树、樟树东、长垣、镇平、资溪、鹰潭北、抚州东、进贤南、玉山南、湘潭北、韶山南、娄底南、邵阳北、新化南、溆浦南、怀化南、新晃西、芷江、大余、三江南、恭城、鹿寨北、南宁西、隆安东、田东北、会昌北、德保、靖西、阳朔、邵东、双峰北、博白、砀山南、永城北、萧县北、宾阳、柳江、瑞昌西、长沙西、麓谷、尖山、开福寺、观沙岭、八方山、谷山、德兴东、鄱阳、都昌、红柳林、杨桥、观音机场、睢宁、茶陵、茶陵南、灌南、灌云、丰城东、新干东、吉水西、万安县、兴国西、神木西、宝应、高邮、扬州东、高邮北、焦作西、米易东、盐边、邳州东、新沂南、宁都、石城东、芙蓉镇、古丈西、吉首东、凤凰古城、麻阳西、定南南、龙南东、信丰西、宁乡西",
            "18:00"=>"安口窑、安陆、安溪、野三关、巴山、白河东、白河县、白水江、蚌埠、蚌埠南、博山、博兴、蔡家坡、曹县、昌乐、城固、城阳、赤壁、赤壁北、滁州、滁州北、磁窑、大荔、大冶北、大竹园、丹凤、当阳、定陶、定远、东营、鄂州、鄂州东、凤县、凤阳、凤州、福安、福鼎、福清、富县、富县东、甘泉、甘泉北、高密、高滩、葛店南、古田、谷城、固始、固镇、冠豸山南、冠豸山、光泽、海湾、涵江、汉川、汉阴、合阳、贺胜桥东、横沟桥东、红安、红安西、宏庆、花湖、花山南、花园、华容、华容东、华容南、孟塬、华山北、淮北、淮滨、黄冈、黄冈东、黄冈西、黄陵、黄石、黄石北、黄石东、黄州、徽县、嘉善、嘉祥、建宁县北、建宁南、建瓯、建始、建阳、将乐、胶州、胶州北、角美、界首市、晋江、京山、靖边、莒县、巨野、鄄城、来舟、莱芜东、蓝村、连江、梁山、聊城、临清、临淄、灵璧、龙山镇、陇县、芦潮港、罗山、罗源、略阳、马鞍山、毛坝、毛坝关、米脂、勉县、庙山、闽清、明港、明港东、明光、南仇、南湖东、南靖、南平、南平南、宁德、平原、莆田、蒲城、蒲城东、普安、岐山、千河、千阳、秦岭、青龙山、青州市、清涧县、泉州、泉州东、确山、乳山、三元区、三明北、三原、山坡东、商城、商洛、商南、上杭、邵武、沈丘、石泉县、顺昌、泗水、泗县、松江、松滋、绥德、遂平、孙镇、台前、太姥山、泰宁、郯城、汤逊湖、滕州、滕州东、天门、潼关、土地堂东、万源、韦庄、渭南、渭南北、渭南南、涡阳、乌龙泉南、吴堡、五莲、武当山、武功、武穴、武夷山、西安南、西平、西乡、浠水、霞浦、仙桃西、咸宁、咸宁北、咸宁东、咸宁南、咸阳、咸阳西、项城、小河镇、孝感、孝感北、新县、兴平、宿州、宿州东、宣汉、旬阳、旬阳北、阎良、兖州、砚川、燕子砭、阳谷、阳平关、阳新、杨陵、杨陵南、沂南、沂水、宜城、应城、永安、永定、永乐店、永泰、尤溪、禹城、云梦、云霄、郓城、枣庄、枣庄西、柞水、张桥、章丘、漳平、漳浦、漳州、漳州东、长汀、长阳、诏安、镇安、枝城、枝江北、纸坊东、钟家村、钟祥、诸城、子长、子洲、紫阳、棕溪、邹城、左岭、晏城、仙游、惠安、礼泉、乾县、永寿、长武、彬州、息县、两当、平度、坪上、陵城、临邑、商河、阳信、滨州、利津南、东营南、长汀南、古田会址、黄陵南、虢镇、光山、枣庄东、枫林、太和北、阿房宫、鄠邑、佛坪、洋县西、城固北、宁强南、平原东、禹城东、淮北北、锦界、蜀河、五通、朝天南、章丘北、邹平、临淄北、青州市北、高密北、董家口、齐河、双洋、三明、雁石南、永安南、延平、延平西、延平东、南平市、漳平西、云梦东、安陆西、古城北、丹江口、武当山西、萧县、渭南西、洛川东、松溪、政和、建瓯东、屏南、周宁、支提山、高坪、兰陵北、龙口市、蓬莱市、彬州东、永寿西、礼泉南、咸阳北、仙桃、长乐、长乐东、长乐南、平潭、蒲石、陈庄、铜川东，耀州，富平县，庄里、华山、华州、临潼、卧龙寺、眉县东、宁化、清流、水茜、杨源、治江、嘉祥北、巨野北、庄寨、浠水南、武穴北、南漳、保康县、神农架、兴山、巴东",
        ];
        foreach ($data as $time=>$station){
            $stationArr = explode('、', $station);
            if(in_array($startStation,$stationArr)){
                return $time;
            }
        }
        return false;
    }
}